/* 
    NodeJs 使用 CommonJS 定义 js文件，
    在NodeJS中使用CommonJs模块化，不需要使用新的后缀名
*/

const ziyue = (text) => `
                 __._                                   
                / ___)_                                 
               (_/Y ===\\                                          __ 
               |||.==. =).                                          | 
               |((| o |p|      |  ${text}
            _./| \\(  /=\\ )     |__                    
          /  |@\\ ||||||||.                             
         /    \\@\\ ||||||||\\                          
        /   \\  \\@\\ ||||||//\\                        
       (     Y  \\@\\|||| // _\\                        
       |    -\\   \\@\\ \\\\//    \\                    
       |     -\\__.-./ //\\.---.^__                        
       | \\    /  |@|__/\\_|@|  |  |                         
       \\__\\      |@||| |||@|     |                    
       <@@@|     |@||| |||@|    /                       
      / ---|     /@||| |||@|   /                                 
     |    /|    /@/ || |||@|  /|                        
     |   //|   /@/  ||_|||@| / |                        
     |  // \\ ||@|   /|=|||@| | |                       
     \\ //   \\||@|  / |/|||@| \\ |                     
     |//     ||@| /  ,/|||@|   |                        
     //      ||@|/  /|/||/@/   |                        
    //|   ,  ||//  /\\|/\\/@/  / /                      
   //\\   /   \\|/  /H\\|/H\\/  /_/                     
  // |\\_/     |__/|H\\|/H|\\_/                         
 |/  |\\        /  |H===H| |                            
     ||\\      /|  |H|||H| |                            
     ||______/ |  |H|||H| |                             
      \\_/ _/  _/  |L|||J| \\_                          
      _/  ___/   ___\\__/___ '-._                       
     /__________/===\\__/===\\---'                      
                                                        
`;

let a = 23

let b = '模块化'

const c = () => {
    return a
}

// module.exports = ziyue
/* 
    CommonJS 导出的是真的对象，
    所以通过将导出的变量赋给 module.exports 对象的属性值来实现导出别名
*/
module.exports = {
    say: ziyue,
    b,
    getA: c
}


/* 
    也可以使用 exports 进行导出，exports 是 module.exports 初始值的引用，
    而CommonJS 实际上是通过导出 module.exports 指向的空间，
    因此不能将 exports 和 module.exports 混用，因为实际只导出 module.exports
    而一旦修改 module.exports = 新对象，那 exports 指向的初始化空间就无效了。
    exports = {
        say: ziyue,
        b,
        getA: c
    }
*/